Revit 2027 API
BuiltInFailures.CutterFailures.MakeCutterForSectionGStepFailed Property
 Attempt to create or manipulate a segmented section has failed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MakeCutterForSectionGStepFailed { get; }
Public Shared ReadOnly Property MakeCutterForSectionGStepFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MakeCutterForSectionGStepFailed {
	FailureDefinitionId^ get ();
}
static member MakeCutterForSectionGStepFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CutterFailures Class
Autodesk.Revit.DB Namespace